AUTO_config_TK_pesok/src/ExchangePlans/ОбменFirestore/ОбменFirestore.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="8139bf0c-876e-40bd-bcca-a4e2a8ba1cba">
  <name>ОбменFirestore</name>
  <attributes>
    <name>Service_CloudFirestoreAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Service_IdentityToolkitAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Project_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Web_API_Key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ExchangePlan>

AUTO_config_TK_pesok/src/ExchangePlans/ОбменFirestore/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция НайтиУзелОбмена(КодУзла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменFirestore.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменFirestore КАК ОбменFirestore
		|ГДЕ
		|	ОбменFirestore.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда
		Возврат ПланыОбмена.ОбменFirestore.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции



Функция НастройкиУзла(КодУзла)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура("Service_CloudFirestoreAPI, Service_IdentityToolkitAPI, Project_ID, Web_API_Key, UserUID");
	УзелОбмена = НайтиУзелОбмена(КодУзла);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменFirestore.Service_CloudFirestoreAPI КАК Service_CloudFirestoreAPI,
		|	ОбменFirestore.Service_IdentityToolkitAPI КАК Service_IdentityToolkitAPI,
		|	ОбменFirestore.Project_ID КАК Project_ID,
		|	ОбменFirestore.Web_API_Key КАК Web_API_Key,
		|	ОбменFirestore.UserUID КАК UserUID
		|ИЗ
		|	ПланОбмена.ОбменFirestore КАК ОбменFirestore
		|ГДЕ
		|	ОбменFirestore.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНастроек,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции

	
	
	
#КонецЕсли
